<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-verein] Neuer Vereinsnamen + neue Idee
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-verein/2009-January/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-verein%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-verein%5D%20Neuer%20Vereinsnamen%20%2B%20neue%20Idee&In-Reply-To=%3C496B99E1.3040309%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000008.html">
   <LINK REL="Next"  HREF="000011.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-verein] Neuer Vereinsnamen + neue Idee</H1>
    <B>Malte Rei&#223;ig</B> 
    <A HREF="mailto:deepamehta-verein%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-verein%5D%20Neuer%20Vereinsnamen%20%2B%20neue%20Idee&In-Reply-To=%3C496B99E1.3040309%40deepamehta.de%3E"
       TITLE="[deepamehta-verein] Neuer Vereinsnamen + neue Idee">mre at deepamehta.de
       </A><BR>
    <I>Mon Jan 12 20:28:33 CET 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000008.html">[deepamehta-verein] Neuer Vereinsnamen + neue Idee
</A></li>
        <LI>Next message: <A HREF="000011.html">[deepamehta-verein] Neuer Vereinsnamen + neue Idee
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#10">[ date ]</a>
              <a href="thread.html#10">[ thread ]</a>
              <a href="subject.html#10">[ subject ]</a>
              <a href="author.html#10">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Lieber Martin,

ich finde deinen Vorschlag gut und das Angebot der TUB auch! Ich hab da
momentan auch keinerlei Bedenken dort schon eine vereins instanz mit
&#246;fftl. forum anzuschlie&#223;en. &quot;Einem geschenkten Gaul, wa..&quot; ! Wenn du
eine Verreinsinstanz aufsetzen k&#246;nntest sowie ein Messageboard und platz
f&#252;r eine HTML Seite organisieren kannst, w&#228;re das ja schonmal
fantastisch. Alles weitere liegt mir gerade noch zu fern.

Lieben Gru&#223;,

Malte

ps. Etwaige Fragen zu deiner Idee hab ich einfach mal inline liegen lassen.


Martin Delius wrote on 07.01.2009 22:08:
&gt;<i> Die Idee des eigenen Angebots an vielleicht sogar modifizierten L&#246;sungen mit
</I>&gt;<i> DeepaMehta ist daher auch f&#252;r mich der erste Schritt in eine sinnvolle
</I>&gt;<i> Vereinst&#228;tigkeit.Ich m&#246;chte aber gern noch weiter gehen und vorschlagen,
</I>&gt;<i> diesen Service f&#252;r Vereinsmitglieder nat&#252;rlich kostenlos anzubieten aber nur
</I>&gt;<i> f&#252;r diese. Ich denke dabei an einen weiteren Anreitz f&#252;r neue (junge)
</I>&gt;<i> Mitglieder. 
</I>F&#252;r Vereinsprojekte und Mitglieder etwaige Instanzen mit speziellen
Workspaces aufsetzen und dies alles &#252;ber's web zu liefern? Ich frage
mich nur was du f&#252;r ein einfaches Angebot meinst?
&gt;<i> Wir sollten einen Teil unserer Arbeit auf die Bereitstellung
</I>&gt;<i> solcher Resourcen konzentrieren wie ich finde. Dazu scheint mir eine
</I>&gt;<i> dauerhafte komplette L&#246;sung wie ein Vereinsserver sinnvoll. Wir k&#246;nnen so
</I>&gt;<i> jedem die M&#246;glichkeit geben zu Entwickeln und zu Testen, zu Pr&#228;sentieren und
</I>&gt;<i> zu Demonstrieren und nat&#252;rlich auf gemeinsam zu dokumentieren.
</I>&gt;<i> So ich denke das war es zum Inhaltlichen
</I>Das jeder entwickeln und testen kann k&#246;nnte ein Ziel f&#252;r dieses Jahr
sein, kurzfristig sehe ich da keine L&#246;sung &quot;am Start&quot;. Demonstieren und
Pr&#228;sentieren kann ja schon jetzt jeder der einen Account auf
deepamehta.de hat.
&gt;<i> Nun zum Realisierbaren
</I>&gt;<i> Wie Malte schon erw&#228;hnt hat habe ich mich testhalber schoneinmal daran
</I>&gt;<i> gesetzt einen zweiten Server aufzusetzen. Konkret ist das ein freeBSD-jail
</I>&gt;<i> auf einem professionell gewartetem und offiziellen Uniserver. Das Jail ist
</I>&gt;<i> &#246;ffentlich zug&#228;nglich &#252;ber den DFN-Knoten der Berliner Hochschulen (sch&#246;&#246;&#246;n
</I>&gt;<i> schnell). Ich denke damit k&#246;nnen wir in einer &#220;bergangszeit (in der ein
</I>&gt;<i> Rootserver bezahlbar wird) ohne gr&#246;&#223;ere Probleme die Anforderungen und Ideen
</I>&gt;<i> der Vereinsmitglieder bearbeiten. Installiert werden kann dort prinzipiell
</I>&gt;<i> alles und um Portfreigaben f&#252;r die Unifirewall sowie Userrights und
</I>&gt;<i> Absprache mit den Betreibern k&#252;mmere ich mich gerne.
</I>&gt;<i> Wenn ihr Lust habt und dem zustimmen wollt, so gebe ich dem Verein gern
</I>&gt;<i> Zugang darauf und wir k&#246;nnen zum Beispiel neben einem dms auch mehrere
</I>&gt;<i> Instanzen, ein Website, eine gemeinsame Datenbank und Entwicklerumgebung
</I>&gt;<i> verwirklichen. Ich freue mich sehr dar&#252;ber wenn ihr mir Anregungen, Fragen
</I>&gt;<i> und Probleme, an die ich dabei wahrscheinlich noch nicht gedacht habe,
</I>&gt;<i> schreibt. Ich denke aber auch das hier die M&#246;glichkeit besteht (ohne Kosten)
</I>&gt;<i> Urs' Idee zeitnah zu verwirklichen. Die TU Berlin stellt uns das Jail
</I>&gt;<i> offiziell zur Verf&#252;gung, so dass wir stabil auf diesen Service zugreifen
</I>&gt;<i> k&#246;nnen.
</I>&gt;<i>   
</I>Klingt super! Wie langfristig k&#246;nnten wir damit rechnen/arbeiten?
&gt;<i> Zusammenfassend bin ich nat&#252;rlich daf&#252;r dies anzupacken.
</I>&gt;<i> Was haltet ihr also von der Idee?
</I>&gt;<i>
</I>&gt;<i> mfg
</I>&gt;<i> Martin
</I>&gt;<i>
</I>&gt;<i>   
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000008.html">[deepamehta-verein] Neuer Vereinsnamen + neue Idee
</A></li>
	<LI>Next message: <A HREF="000011.html">[deepamehta-verein] Neuer Vereinsnamen + neue Idee
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#10">[ date ]</a>
              <a href="thread.html#10">[ thread ]</a>
              <a href="subject.html#10">[ subject ]</a>
              <a href="author.html#10">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-verein">More information about the deepamehta-verein
mailing list</a><br>
</body></html>
