<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-verein] DITA und DeepaMehta 3
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-verein/2009-February/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-verein%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-verein%5D%20DITA%20und%20DeepaMehta%203&In-Reply-To=%3C1234043453.7084.20.camel%40ursX61s%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000015.html">
   <LINK REL="Next"  HREF="000017.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-verein] DITA und DeepaMehta 3</H1>
    <B>Urs Lerch</B> 
    <A HREF="mailto:deepamehta-verein%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-verein%5D%20DITA%20und%20DeepaMehta%203&In-Reply-To=%3C1234043453.7084.20.camel%40ursX61s%3E"
       TITLE="[deepamehta-verein] DITA und DeepaMehta 3">mail at ulerch.net
       </A><BR>
    <I>Sat Feb  7 22:50:53 CET 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000015.html">[deepamehta-verein] DITA und DeepaMehta 3
</A></li>
        <LI>Next message: <A HREF="000017.html">[deepamehta-verein] Fwd:  Vorschl&#228;ge zum Namen
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#18">[ date ]</a>
              <a href="thread.html#18">[ thread ]</a>
              <a href="subject.html#18">[ subject ]</a>
              <a href="author.html#18">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo J&#246;rg,

soweit ich das verstehe, geht es hier in erster Linie um einen Standard,
wie Daten in einer Metasprache abgelegt werden. Aufgrund weiterer Infos
bei IBM (<A HREF="http://www.ibm.com/developerworks/xml/library/x-dita1/">http://www.ibm.com/developerworks/xml/library/x-dita1/</A>) gehe
ich auch davon aus, dass es noch keine Implementation gibt - die
Referenzimplementation, die vorhanden ist, hat gar nichts mit DeepaMehta
zu tun.

Meine pers&#246;nliche Meinung ist es, wo immer m&#246;glich Standards zu
unterst&#252;tzen - man kann nur gewinnen. Somit w&#252;rde ich DITA als neue
&quot;Storageengine&quot; f&#252;r DeepaMehta sehen. Das ist meiner Meinung nach auch
eines der Probleme von DeepaMehta, dass die TopicMaps eine Eigenkreation
sind.

Ich w&#252;rde es begr&#252;ssen, mal informell mit IBM Kontakt aufzunehmen und
sehen, was da passiert. Aufgrund meiner Erfahrung sind die auch durchaus
offen und fair. Ich k&#246;nnte mir vorstellen, dass IBM an einem Back- und
Frontend interessiert ist, das nicht von Grund auf neu entwickelt werden
muss. Ich w&#228;re auch bereit, das als Erster Vorsitzender quasi offiziell
zu machen.

Eine weitere Kooperation, die aus meiner Sicht Sinn machen k&#246;nnte, w&#228;re
mit Nepomuk. F&#252;r DeepaMehta k&#246;nnte da der Crawler sehr n&#252;tzlich sein
k&#246;nnte.

Gruss,
Urs

Am Samstag, den 07.02.2009, 17:31 +0100 schrieb J&#246;rg Richter:
&gt;<i> Lieber DeepaMehta-Verein :-)
</I>&gt;<i> 
</I>&gt;<i> ich m&#246;chte euch hier Infos zu DeepaMehta schicken, die zwar nicht 
</I>&gt;<i> speziell f&#252;r den Verein erstellt wurden, aber m&#246;glicherweise auch dem 
</I>&gt;<i> Verein helfen k&#246;nnen, die DeepaMehta-Philosophie zu vermitteln, z.B. 
</I>&gt;<i> auf der bevorstehenden CeBIT. Auch ist dieser Input als &quot;Lebenszeichen&quot; 
</I>&gt;<i> gedacht, da meine Vereinsaktivit&#228;t bisher sehr gering ist.
</I>&gt;<i> 
</I>&gt;<i> In der folgenden Info wird DITA und &quot;DeepaMehta 3&quot; erw&#228;hnt. DITA -- 
</I>&gt;<i> Darwin Information Typing Architecture -- ist ein offener OASIS 
</I>&gt;<i> Standard zum Managen und Publizieren von modularem Content, und wird 
</I>&gt;<i> u.a. von IBM gef&#246;rdert (Whitepaper anbei). &quot;DeepaMehta 3&quot; steht f&#252;r den 
</I>&gt;<i> n&#228;chsten gro&#223;en Evolutionsschritt (der wahrscheinlich einen kompletten 
</I>&gt;<i> Rewrite darstellt) und wird m&#246;glicherweise Gebrauch von DITA machen.
</I>&gt;<i> 
</I>&gt;<i> Gr&#252;&#223;e
</I>&gt;<i> J&#246;rg
</I>&gt;<i> 
</I>&gt;<i> ------------------------------------
</I>&gt;<i> 
</I>&gt;<i> vielen Dank [...], f&#252;r das DITA-Whitepaper! DITA kannte ich noch nicht.
</I>&gt;<i> Im Folgenden mein Feedback dazu.
</I>&gt;<i> 
</I>&gt;<i> Zun&#228;chst einmal finde ich gut zu sehen, da&#223; -- was das BACKEND betrifft 
</I>&gt;<i> -- auch gro&#223;e verdiente Unternehmen eine Richtung beschreiben, die 
</I>&gt;<i> DeepaMehta sehr &#228;hnlich ist. F&#252;r mich zeigt das, da&#223; wir mit DeepaMehta 
</I>&gt;<i> einen aussichtsreichen Weg gehen, und da&#223; es f&#252;r uns in Zukunft 
</I>&gt;<i> einfacher werden wird, die DeepaMehta-Idee und ihre Vorteile zu 
</I>&gt;<i> kommunizieren.
</I>&gt;<i> 
</I>&gt;<i> Auff&#228;llige &#196;hnlichkeiten zwischen DITA und DeepaMehta:
</I>&gt;<i> =&gt; Entkopplung (&quot;Befreiung&quot;) der Daten von ihren Applikationen.
</I>&gt;<i> =&gt; Evolution&#228;rer Ansatz: bei sich ver&#228;ndernden Prozessen (&quot;wachsendes 
</I>&gt;<i> Unternehmen&quot;) werden Datentyp-Definitionen erweitert, ohne da&#223; 
</I>&gt;<i> vorhandene Daten/Anwendungen kompromitiert werden.
</I>&gt;<i> =&gt; Eine zentrale Datenablage erm&#246;glicht &quot;Single-Entry&quot; und unterst&#252;tzt 
</I>&gt;<i> Kollaboration.
</I>&gt;<i> =&gt; Kontextsensitvit&#228;t: ein und dasselbe Datenobjekt wird in 
</I>&gt;<i> verschiedenen Arbeitskontexten (&quot;Maps&quot;) benutzt und steht verschiedenen 
</I>&gt;<i> Anwendungen zur Verf&#252;gung (&quot;Cross-Application&quot;).
</I>&gt;<i> =&gt; Repr&#228;sentation von Semantik durch Typisierung und 
</I>&gt;<i> in-Beziehung-setzen von Datenobjekten.
</I>&gt;<i> =&gt; Dynamisches Publizieren: Datenobjekte werden zu gr&#246;&#223;eren Einheiten 
</I>&gt;<i> aggregiert und in spezifische Formate f&#252;r unterschiedliche 
</I>&gt;<i> &#220;bertragungskan&#228;le/Medien transformiert.
</I>&gt;<i> =&gt; Offene Daten- und Service-Schnittstellen erm&#246;glichen, vorhandene 
</I>&gt;<i> Daten neuen Applikationen zuzuf&#252;hren und Applikationen miteinander zu 
</I>&gt;<i> verbinden (&quot;Mashups&quot;).
</I>&gt;<i> =&gt; Einbindung externer Datenquellen und Services.
</I>&gt;<i> =&gt; Verschmelzung manueller (nicht-formalisierbarer) Prozesse mit 
</I>&gt;<i> automatischen Prozessen.
</I>&gt;<i> 
</I>&gt;<i> Als Ingenieur w&#252;rde ich gerne genaueres &#252;ber die technischen 
</I>&gt;<i> DITA-Konzepte erfahren (das Whitepaper sehe ich eher als 
</I>&gt;<i> Marketing/&#214;ffentlichkeitsarbeit-Instrument):
</I>&gt;<i> =&gt; Wie wird Versionierung in DITA gehandhabt? Auf welcher Ebene 
</I>&gt;<i> (Datenobjekte, Typen, Maps) wird versioniert?
</I>&gt;<i> =&gt; Wie werden externe Datenquellen eingebunden? (Replication vs. 
</I>&gt;<i> Reference)
</I>&gt;<i> =&gt; Auf welcher Ebene arbeitet das Rollen- und Rechte-Management?
</I>&gt;<i> =&gt; Welche Struktur-Elemente existieren oberhalb von Maps?
</I>&gt;<i> =&gt; Wie werden mehrere DITA-Installationen miteinander vernetzt? Wie 
</I>&gt;<i> werden Datenobjekte addressiert?
</I>&gt;<i> 
</I>&gt;<i> Was nach meinem ersten Eindruck nicht Bestandteil von DITA ist -- und 
</I>&gt;<i> was meiner Meinung nach die noch gr&#246;&#223;ere Herausforderung darstellt -- 
</I>&gt;<i> ist das Thema FRONTEND. Wie stellt sich ein &quot;Cross-Application&quot;-System 
</I>&gt;<i> dem Benutzer dar? (Das herk&#246;mmliche Prinzip Ein-Frontend-pro-Anwendung 
</I>&gt;<i> taugt hier meiner Meinung nach nicht mehr.)
</I>&gt;<i> =&gt; Wie kann ein &quot;Meta-User Interface&quot; aussehen, das Zugriff auf eine 
</I>&gt;<i> Vielzahl von Anwendungen bietet und gleichzeitig den jeweiligen 
</I>&gt;<i> Arbeitskontext des Anwendenders direkt (ohne Br&#252;che) abbildet?
</I>&gt;<i> 
</I>&gt;<i> Als Alleinstellungsmerkmal von DeepaMehta sehe ich 1) das 
</I>&gt;<i> unfragmentierte &quot;kognitiv-ad&#228;quate&quot; Frontend, und 2) den systemischen 
</I>&gt;<i> Ansatz: DeepaMehta betrachtet das Mensch-Maschine-Gesellschaft Gef&#252;ge 
</I>&gt;<i> als Ganzes und bezieht interdisziplin&#228;re Forschung mit ein (Informatik, 
</I>&gt;<i> Kognitionspsychologie, Linguistik, Soziologie, Technik-Philosophie). 
</I>&gt;<i> Dem DeepaMehta Systemdesign liegen folgende Fragestellungen zugrunde:
</I>&gt;<i> =&gt; Wie entsteht aus Information Wissen? Wie funktioniert der 
</I>&gt;<i> individuelle Wissensbildungsproze&#223;?
</I>&gt;<i> =&gt; Wie ensteht Semantik? Wie wird Bedeutung ausgehandelt?
</I>&gt;<i> =&gt; Unter welchen Bedingungen dienen Information als Handlungsgrundlage?
</I>&gt;<i> =&gt; Welche Leitbilder f&#246;rdern eine nachhaltige Technik-Entwicklung?
</I>&gt;<i> 
</I>&gt;<i> Die Relevanz von DITA f&#252;r &quot;DeepaMehta 3&quot; sehe ich im Moment:
</I>&gt;<i> =&gt; DeepaMehta 3 kann DITA als Backend benutzen. Hierbei stellt sich die 
</I>&gt;<i> Frage, wie weit DITA bereits entwickelt ist, und unter welchen 
</I>&gt;<i> Bedingungen wir es verwenden k&#246;nnen.
</I>&gt;<i> =&gt; DeepaMehta 3 kann selbst als DITA-konformes Backend realisiert 
</I>&gt;<i> werden. Hier ist die Frage, wie die DITA-Spezifikation aussieht.
</I>&gt;<i> =&gt; DITA ist zum Teil Open Source. Welcher Teil genau, das w&#252;rde ich 
</I>&gt;<i> gerne genauer wissen. M&#246;glicherweise kann DITA's Open Source Strategie 
</I>&gt;<i> ein Vorbild f&#252;r DeepaMehta 3 sein.
</I>&gt;<i> =&gt; DITA zeigt, wie Ideen professionell kommuniziert werden k&#246;nnen (das 
</I>&gt;<i> Whitepaper hat eine hohe Qualit&#228;t), und da&#223; es gewinnbringend ist, mit 
</I>&gt;<i> gro&#223;en verdienten Unternehmen (IBM) vernetzt zu sein.
</I>&gt;<i> =&gt; Die DITA-(Marketing-)Sprache und Argumentation kann Anregungen zur 
</I>&gt;<i> Vermarktung von DeepaMehta 3 geben.
</I>&gt;<i> 
</I>&gt;<i> Gr&#252;&#223;e
</I>&gt;<i> J&#246;rg
</I>&gt;<i> 
</I>&gt;<i> www.deepamehta.de
</I>&gt;<i> 
</I>&gt;<i> _______________________________________________
</I>&gt;<i> deepamehta-verein mailing list
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-verein">deepamehta-verein at lists.berlios.de</A>
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-verein">https://lists.berlios.de/mailman/listinfo/deepamehta-verein</A>
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000015.html">[deepamehta-verein] DITA und DeepaMehta 3
</A></li>
	<LI>Next message: <A HREF="000017.html">[deepamehta-verein] Fwd:  Vorschl&#228;ge zum Namen
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#18">[ date ]</a>
              <a href="thread.html#18">[ thread ]</a>
              <a href="subject.html#18">[ subject ]</a>
              <a href="author.html#18">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-verein">More information about the deepamehta-verein
mailing list</a><br>
</body></html>
